In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [75]:
cast = pd.read_csv("data/cast_dataset.csv")
crew = pd.read_csv("data/crew_dataset.csv")
keywords = pd.read_csv("data/keywords_dataframe.csv")
movies = pd.read_csv("data/movies_dataset.csv")

In [76]:
cast.head()

        id                                               cast
0   667538  [{'cast_id': 1560244, 'name': 'Anthony Ramos',...
1   785759  [{'cast_id': 2283865, 'name': 'Belle Adams', '...
2   493529  [{'cast_id': 62064, 'name': 'Chris Pine', 'cha...
3   646389  [{'cast_id': 17276, 'name': 'Gerard Butler', '...
4  1111140  [{'cast_id': 55086, 'name': 'Cam Gigandet', 'c...

In [77]:
cast["cast"] = [x.split("{") for x in cast["cast"]]
cast["cast"] = [x[1:-1] for x in cast["cast"]]

In [80]:
cast["cast"].iloc[1]

["'cast_id': 2283865, 'name': 'Belle Adams', 'character': 'Sarah'}, ",
 '\'cast_id\': 1681685, \'name\': \'Jacob DeMonte-Finn\', \'character\': "Masha\'s one night stand"}, ',
 "'cast_id': 2934926, 'name': 'Tim Fox', 'character': 'Dustin'}, ",
 "'cast_id': 1070188, 'name': 'Clint Glenn Hummel', 'character': 'Charlie'}, ",
 "'cast_id': 1492017, 'name': 'Danielle Kennedy', 'character': 'Mary'}, ",
 "'cast_id': 143549, 'name': 'Rebekah Kennedy', 'character': 'Masha'}, ",
 "'cast_id': 21321, 'name': 'Kristina Klebe', 'character': 'Rachel'}, ",
 "'cast_id': 2625633, 'name': 'Ian Michaels', 'character': 'Simon'}, ",
 '\'cast_id\': 2435782, \'name\': \'Lindsey Rose Naves\', \'character\': "Rachel\'s colleague"}, ',
 "'cast_id': 2834402, 'name': 'Julien Marlon Samani', 'character': 'Paul'}, ",
 "'cast_id': 2649206, 'name': 'Dina Silva', 'character': 'Melissa'}, "]

In [13]:
cast = cast["cast"].explode()

0        [{'cast_id': 1560244, 'name': 'Anthony Ramos',...
1        [{'cast_id': 2283865, 'name': 'Belle Adams', '...
2        [{'cast_id': 62064, 'name': 'Chris Pine', 'cha...
3        [{'cast_id': 17276, 'name': 'Gerard Butler', '...
4        [{'cast_id': 55086, 'name': 'Cam Gigandet', 'c...
                               ...
11995    [{'cast_id': 85881, 'name': 'Sanjay Dutt', 'ch...
11996                                                   []
11997    [{'cast_id': 1340978, 'name': 'Kiara Advani', ...
11998    [{'cast_id': 101856, 'name': 'Shweta Basu Pras...
11999    [{'cast_id': 1675317, 'name': 'Sunny Kaushal',...
Name: cast, Length: 12000, dtype: object

In [6]:
crew.head()

        id                                               crew
0   667538  [{'crew_id': 488, 'name': 'Steven Spielberg', ...
1   785759  [{'crew_id': 2642445, 'name': 'Pierre Tsigarid...
2   493529  [{'crew_id': 547, 'name': 'Victoria Thomas', '...
3   646389  [{'crew_id': 7229, 'name': 'Marco Beltrami', '...
4  1111140  [{'crew_id': 1046465, 'name': 'Raliegh Wilson'...

In [7]:
keywords.head()

   Unnamed: 0      id                                           keywords
0           0   76600  [{'id': 697, 'name': 'loss of loved one'}, {'i...
1           1  713704  [{'id': 380, 'name': 'sibling relationship'}, ...
2           2  758323  [{'id': 514, 'name': 'spain'}, {'id': 588, 'na...
3           3  594767  [{'id': 9715, 'name': 'superhero'}, {'id': 101...
4           4  640146  [{'id': 1701, 'name': 'hero'}, {'id': 3126, 'n...

In [8]:
movies.head()

,genre_ids,id,original_language,overview,popularity,release_date,title,vote_average,vote_count,genres
0,"[16, 10751, 12, 14, 35]",502356,en,"While working underground to fix a water main,...",8374.440,2023-04-05,The Super Mario Bros. Movie,7.7,3163,"Animation, Family, Adventure, Fantasy, Comedy"
1,"[28, 80, 53]",385687,en,Over many missions and against impossible odds...,6742.222,2023-05-17,Fast X,6.9,312,"Action, Crime, Thriller"
2,"[53, 27, 14]",713704,en,Three siblings find an ancient vinyl that give...,3842.290,2023-04-12,Evil Dead Rise,7.1,1233,"Thriller, Horror, Fantasy"
3,"[28, 12, 878]",640146,en,Super-Hero partners Scott Lang and Hope van Dy...,3353.957,2023-02-15,Ant-Man and the Wasp: Quantumania,6.5,2817,"Action, Adventure, Science Fiction"
4,"[28, 53]",552688,en,A deadly female assassin comes out of hiding t...,2930.887,2023-05-04,The Mother,6.7,487,"Action, Thriller"